Revit 2026 API

# CombinableElementArray Class

---

An array that contains CombinableElement objects.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBCombinableElementArray

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class CombinableElementArray : APIObject,
	IEnumerable
```
```vb
Public Class CombinableElementArray
	Inherits APIObject
	Implements IEnumerable
```
```cpp
public ref class CombinableElementArray : public APIObject,
	IEnumerable
```
```fsharp
type CombinableElementArray =
    class
        inherit APIObject
        interface IEnumerable
    end
```

The CombinableElementArray type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CombinableElementArray | Initializes a new instance of the CombinableElementArray class |

|  | Name | Description |
| --- | --- | --- |
|  | IsEmpty | Test to see if the array is empty. |
|  | IsReadOnly | Identifies if the object is read-only or modifiable.(Inherited from APIObject) |
|  | Item | Gets or sets a CombinableElement at a specified index within the array. |
|  | Size | Returns the number of CombinableElements that are in the array. |

|  | Name | Description |
| --- | --- | --- |
|  | Append | Add the element to the end of the array. |
|  | Clear | Removes every CombinableElement from the array, rendering it empty. |
|  | Dispose | Causes the object to release immediately any resources it may be utilizing.(Inherited from APIObject) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | ForwardIterator | Retrieve a forward moving iterator to the array. |
|  | GetEnumerator | Retrieve a forward moving iterator to the array. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | Insert | Insert the specified element into the array. |
|  | ReverseIterator | Retrieve a backward moving iterator to the array. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB Namespace